zyronjoshh-alt/RONWIFI_ESP8266/http_server.cpp
#include "http_server.h"
#include "config.h"
#include "coinslot.h"
#include "rates.h"
#include "mikrotik_client.h"
#include <ESP8266WiFi.h>
#include <ESP8266WebServer.h>
#include <ArduinoJson.h>
#include <LittleFS.h>

static ESP8266WebServer server(80);

// Session state for current coin transaction
static String s_currentSessionId = "";
static String s_currentMac = "";
static String s_currentIp = "";
static uint32_t s_sessionStartMs = 0;

// ---------- Helpers ----------
static void sendJson(int code, const String& body) {
  server.sendHeader("Access-Control-Allow-Origin", "*");
  server.send(code, "application/json", body);
}

static void sendJsonOk(const String& dataJson) {
  sendJson(200, String("{\"ok\":true,\"data\":") + dataJson + "}");
}

static void sendJsonError(int code, const String& errCode, const String& msg) {
  String body = String("{\"ok\":false,\"error\":{\"code\":\"") + errCode +
                "\",\"message\":\"" + msg + "\"}}";
  sendJson(code, body);
}

static bool requireAdminAuth() {
  if (!server.authenticate(g_config.admin.username.c_str(), g_config.admin.password.c_str())) {
    server.requestAuthentication();
    return false;
  }
  return true;
}

// ---------- CORS preflight ----------
static void handleOptions() {
  server.sendHeader("Access-Control-Allow-Origin", "*");
  server.sendHeader("Access-Control-Allow-Methods", "POST,GET,OPTIONS");
  server.sendHeader("Access-Control-Allow-Headers", "Content-Type");
  server.send(204);
}

// ---------- PORTAL FALLBACK ENDPOINTS ----------
static void handlePing() {
  String body = String("{\"vendo_id\":") + g_config.vendo_id +
                ",\"vendo_name\":\"" + g_config.vendo_name + "\"" +
                ",\"uptime_s\":" + (millis() / 1000) +
                ",\"firmware\":\"" FIRMWARE_VERSION "\"}";
  sendJsonOk(body);
}

static void handleCoinStart() {
  // Parse body
  StaticJsonDocument<256> doc;
  DeserializationError err = deserializeJson(doc, server.arg("plain"));
  if (err) {
    sendJsonError(400, "bad_json", "Invalid JSON body");
    return;
  }

  String mac = doc["mac"] | "";
  String ip = doc["ip"] | "";
  if (mac.length() < 12 || ip.length() < 7) {
    sendJsonError(400, "bad_params", "mac and ip required");
    return;
  }

  // If already armed/counting, reject
  CoinState cs = coinslotGetState();
  if (cs == CS_ARMED || cs == CS_COUNTING || cs == CS_FINALIZING) {
    sendJsonError(409, "busy", "Coinslot busy");
    return;
  }

  // Pre-check MikroTik login (3 attempts)
  bool mikrotikOk = false;
  for (int i = 0; i < 3; i++) {
    if (mikrotikPing()) { mikrotikOk = true; break; }
    delay(500);
  }
  if (!mikrotikOk) {
    sendJsonError(503, "mikrotik_unreachable", "Could not reach MikroTik after 3 attempts");
    return;
  }

  // Generate simple session ID
  s_currentSessionId = String(millis(), HEX);
  s_currentMac = mac;
  s_currentMac.toUpperCase();
  s_currentIp = ip;
  s_sessionStartMs = millis();

  coinslotArm();

  String body = String("{\"session_id\":\"") + s_currentSessionId + "\",\"state\":\"armed\"}";
  sendJsonOk(body);
}

static String macWithColons(const String& noColons) {
  if (noColons.length() != 12) return noColons;
  String out = "";
  for (int i = 0; i < 12; i += 2) {
    out += noColons.substring(i, i + 2);
    if (i < 10) out += ":";
  }
  return out;
}

static void handleCoinDone() {
  StaticJsonDocument<256> doc;
  deserializeJson(doc, server.arg("plain"));

  if (coinslotGetState() == CS_IDLE) {
    sendJsonError(400, "no_session", "No active session");
    return;
  }

  coinslotSetState(CS_FINALIZING);
  uint32_t pulseCount = coinslotGetPulseCount();
  uint32_t pesos = pulseCount;  // 1 pulse = ₱1 (Allan coin slot programming)

  if (pesos == 0) {
    coinslotDisarm();
    sendJsonOk("{\"pesos\":0,\"minutes\":0,\"status\":\"cancelled\"}");
    s_currentSessionId = "";
    return;
  }

  uint32_t minutes = calculateMinutes(pesos);

  // Create/login MikroTik user
  bool ok = false;
  for (int i = 0; i < 3; i++) {
    if (mikrotikCreateAndLoginUser(s_currentMac,
                                    macWithColons(s_currentMac),
                                    s_currentIp,
                                    minutes)) {
      ok = true;
      break;
    }
    delay(500);
  }

  coinslotDisarm();

  if (!ok) {
    // Write to emergency log
    File f = LittleFS.open("/emergency.log", "a");
    if (f) {
      f.print(millis()); f.print("|");
      f.print(s_currentMac); f.print("|");
      f.print(s_currentIp); f.print("|");
      f.print(pesos); f.print("|");
      f.println(minutes);
      f.close();
    }
    sendJsonError(503, "mikrotik_failed", "Could not register user on MikroTik (logged locally)");
    s_currentSessionId = "";
    return;
  }

  String body = String("{\"pesos\":") + pesos +
                ",\"minutes\":" + minutes +
                ",\"status\":\"ok\"}";
  sendJsonOk(body);
  s_currentSessionId = "";
}

static void handleCoinCancel() {
  if (coinslotGetState() != CS_IDLE) {
    coinslotDisarm();
  }
  s_currentSessionId = "";
  sendJsonOk("{\"status\":\"cancelled\"}");
}

static void handleStatus() {
  // URI: /status/{session_id}
  String uri = server.uri();
  int slash = uri.lastIndexOf('/');
  String sid = (slash >= 0) ? uri.substring(slash + 1) : "";
  (void)sid;

  uint32_t pulses = coinslotGetPulseCount();
  uint32_t minutes = calculateMinutes(pulses);
  uint32_t lastPulse = coinslotLastPulseMs();
  uint32_t inactiveMs = lastPulse ? (millis() - lastPulse) : 0;

  String body = String("{\"pesos\":") + pulses +
                ",\"minutes\":" + minutes +
                ",\"state\":\"" + (coinslotGetState() == CS_ARMED ? "armed" :
                                   coinslotGetState() == CS_COUNTING ? "counting" : "idle") + "\"" +
                ",\"inactive_ms\":" + inactiveMs + "}";
  sendJsonOk(body);
}

static void handleRates() {
  String body = "{\"tiers\":[";
  for (uint8_t i = 0; i < g_rates_count; i++) {
    if (i > 0) body += ",";
    body += "{\"label\":\"" + g_rates[i].label + "\"," +
            "\"pesos\":" + g_rates[i].pesos + "," +
            "\"minutes\":" + g_rates[i].minutes + "}";
  }
  body += "]}";
  sendJsonOk(body);
}

// ---------- ADMIN UI ----------
static const char ADMIN_HTML[] PROGMEM = R"HTML(
<!DOCTYPE html><html><head><meta charset="UTF-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>RONwifi Admin</title>
<style>
*{box-sizing:border-box}
body{font-family:system-ui,-apple-system,sans-serif;background:#f3f4f6;color:#1f2937;max-width:700px;margin:0 auto;padding:12px;font-size:14px}
h1{font-size:20px;margin:8px 0 4px;color:#2563eb}
.subtitle{color:#6b7280;font-size:12px;margin-bottom:16px}
h2{font-size:15px;margin:0 0 12px;color:#1f2937;padding-bottom:8px;border-bottom:1px solid #e5e7eb}
.card{background:#fff;border:1px solid #e5e7eb;border-radius:10px;padding:16px;margin-bottom:12px}
.row{display:flex;justify-content:space-between;padding:4px 0;font-size:13px}
.label{color:#6b7280}
.value{font-family:monospace;font-weight:600}
.status-ok{color:#10b981;font-weight:bold}
.status-err{color:#ef4444;font-weight:bold}
.status-warn{color:#f59e0b;font-weight:bold}

label.fld{display:block;margin:10px 0 0}
label.fld>span{display:block;font-size:12px;color:#6b7280;margin-bottom:4px;font-weight:600}
input[type=text],input[type=number],input[type=password],select,textarea{width:100%;padding:8px 10px;border:1px solid #d1d5db;border-radius:6px;font-size:14px;font-family:inherit;background:#fff;color:#1f2937}
input[type=checkbox]{width:auto;margin-right:6px;transform:scale(1.2)}
input:focus,select:focus,textarea:focus{outline:none;border-color:#2563eb;box-shadow:0 0 0 3px rgba(37,99,235,.15)}
textarea{font-family:'Consolas',monospace;font-size:12px;min-height:140px;resize:vertical}

