zyronjoshh-alt/RONWIFI_ESP8266/http_server.cpp
<!-- PINS -->
<div class="card">
<h2>📍 Pins (GPIO)</h2>
<div class="grid2">
<label class="fld"><span>Coinslot Signal</span>
<select name="pins_signal">
<option value="none">none</option>
<option value="D0">D0 (GPIO16)</option>
<option value="D1">D1 (GPIO5)</option>
<option value="D2">D2 (GPIO4) - default</option>
<option value="D3">D3 (GPIO0)</option>
<option value="D4">D4 (GPIO2)</option>
<option value="D5">D5 (GPIO14)</option>
<option value="D6">D6 (GPIO12)</option>
<option value="D7">D7 (GPIO13)</option>
<option value="D8">D8 (GPIO15)</option>
</select></label>
<label class="fld"><span>Coinslot Set (Inhibit)</span>
<select name="pins_set">
<option value="none">none</option>
<option value="D0">D0 (GPIO16)</option>
<option value="D1">D1 (GPIO5) - default</option>
<option value="D2">D2 (GPIO4)</option>
<option value="D3">D3 (GPIO0)</option>
<option value="D4">D4 (GPIO2)</option>
<option value="D5">D5 (GPIO14)</option>
<option value="D6">D6 (GPIO12)</option>
<option value="D7">D7 (GPIO13)</option>
<option value="D8">D8 (GPIO15)</option>
</select></label>
</div>
<div class="grid2">
<label class="fld"><span>LED</span>
<select name="pins_led">
<option value="none">none</option>
<option value="D0">D0 (GPIO16)</option>
<option value="D4">D4 (GPIO2) - built-in</option>
<option value="D5">D5 (GPIO14)</option>
<option value="D6">D6 (GPIO12)</option>
<option value="D7">D7 (GPIO13)</option>
</select></label>
<label class="fld"><span>Buzzer</span>
<select name="pins_buzzer">
<option value="none">none</option>
<option value="D5">D5 (GPIO14)</option>
<option value="D6">D6 (GPIO12)</option>
<option value="D7">D7 (GPIO13)</option>
<option value="D8">D8 (GPIO15)</option>
</select></label>
</div>
<div class="grid3">
<label class="fld"><span>Signal Active Low</span>
<select name="pins_signal_active_low"><option value="true">Yes (falling edge)</option><option value="false">No (rising edge)</option></select></label>
<label class="fld"><span>Set Active Low</span>
<select name="pins_set_active_low"><option value="true">Yes (LOW=enable)</option><option value="false">No (HIGH=enable)</option></select></label>
<label class="fld"><span>A0+3V Reset</span>
<select name="pins_a0_reset_enabled"><option value="true">Enabled</option><option value="false">Disabled</option></select></label>
</div>
</div>

<!-- AUTO RESTART -->
<div class="card">
<h2>♻️ Auto Restart</h2>
<label class="fld" style="display:flex;align-items:center;margin:8px 0">
<input type="checkbox" name="auto_restart_enabled">
<span style="margin-left:6px">Enable scheduled auto-restart</span></label>
<label class="fld"><span>Interval (minutes)</span><input type="number" name="auto_restart_interval" min="1" value="1440"></label>
<div style="font-size:12px;color:#6b7280;margin-top:4px">Default 1440 min = 24h. Reboot waits for active coin session to finish.</div>
</div>

<!-- RATES -->
<div class="card">
<h2>💰 Rates (Pricing Tiers)</h2>
<table id="ratesTable" style="width:100%;border-collapse:collapse;font-size:13px">
<thead><tr><th style="text-align:left;padding:6px">Label</th><th style="width:100px;padding:6px">Pesos</th><th style="width:100px;padding:6px">Minutes</th><th style="width:40px"></th></tr></thead>
<tbody id="ratesBody"></tbody></table>
<button type="button" class="secondary" onclick="addRateRow()" style="margin-top:8px">+ Add Tier</button>
</div>

<!-- SAVE BAR -->
<div class="save-bar">
<button type="button" class="success" onclick="saveAll()">💾 Save All &amp; Reboot</button>
</div>

</form>

<script>
/* ============ UTILS ============ */
function $(id){return document.getElementById(id)}
function el(name){return document.getElementsByName(name)[0]}
function setVal(name,v){var e=el(name);if(!e)return;if(e.type==='checkbox')e.checked=!!v;else e.value=v==null?'':v}
function getVal(name){var e=el(name);if(!e)return null;return e.type==='checkbox'?e.checked:e.value}
function msg(text,kind){var m=$('msg');m.className='msg msg-'+kind;m.textContent=text;m.scrollIntoView({behavior:'smooth',block:'center'})}
function togglePw(btn){var inp=btn.previousElementSibling;if(inp.type==='password'){inp.type='text';btn.textContent='HIDE'}else{inp.type='password';btn.textContent='SHOW'}}
function toggleCollapse(h){h.classList.toggle('collapsed')}
function toggleStaticFields(){var mode=getVal('network_mode');$('staticFields').style.display=(mode==='static')?'':'none'}

/* ============ API ============ */
function api(method,path,body,cb){
  var x=new XMLHttpRequest();
  x.open(method,path,true);
  x.setRequestHeader('Content-Type','application/json');
  x.onreadystatechange=function(){if(x.readyState===4){
    try{cb(x.status,JSON.parse(x.responseText))}catch(e){cb(x.status,{raw:x.responseText})}
  }};
  x.send(body?JSON.stringify(body):null);
}

/* ============ STATUS ============ */
function loadStatus(){
  api('GET','/admin/status',null,function(s,r){
    if(s<200||s>=300){$('statusContent').innerHTML='<span class="status-err">Error loading</span>';return}
    var d=r.data||{};
    var stateClass=d.state==='idle'?'status-ok':d.state==='error'?'status-err':'status-warn';
    var h='';
    h+='<div class="row"><span class="label">Vendo</span><span class="value">'+d.vendo_name+' (#'+d.vendo_id+')</span></div>';
    h+='<div class="row"><span class="label">Firmware</span><span class="value">'+d.firmware+'</span></div>';
    h+='<div class="row"><span class="label">Uptime</span><span class="value">'+Math.floor(d.uptime_s/3600)+'h '+Math.floor((d.uptime_s%3600)/60)+'m '+(d.uptime_s%60)+'s</span></div>';
    h+='<div class="row"><span class="label">Free Heap</span><span class="value">'+(d.free_heap/1024).toFixed(1)+' KB</span></div>';
    h+='<div class="row"><span class="label">WiFi RSSI</span><span class="value">'+d.rssi+' dBm</span></div>';
    h+='<div class="row"><span class="label">IP</span><span class="value">'+d.ip+'</span></div>';
    h+='<div class="row"><span class="label">Coinslot</span><span class="value '+stateClass+'">'+d.state+'</span></div>';
    h+='<div class="row"><span class="label">Pulses (current)</span><span class="value">'+d.pulse_count+'</span></div>';
    $('statusContent').innerHTML=h;
  });
}

/* ============ CONFIG LOAD ============ */
function loadConfig(){
  api('GET','/admin/config_raw',null,function(s,r){
    if(s<200||s>=300){msg('Failed to load config','err');return}
    var c=r.data||{};
    setVal('vendo_id',c.vendo_id);
    setVal('vendo_name',c.vendo_name);
    var n=c.network||{};
    setVal('network_mode',n.mode||'static');
    setVal('network_static_ip',n.static_ip);
    setVal('network_gateway',n.gateway);
    setVal('network_netmask',n.netmask);
    setVal('network_dns',n.dns);
    toggleStaticFields();
    var w=c.wifi||{};
    setVal('wifi_ssid',w.ssid);
    setVal('wifi_password',w.password);
    var m=c.mqtt||{};
    setVal('mqtt_host',m.host);
    setVal('mqtt_port',m.port);
    setVal('mqtt_username',m.username);
    setVal('mqtt_password',m.password);
    setVal('mqtt_keepalive_seconds',m.keepalive_seconds);
    var mt=c.mikrotik||{};
    setVal('mikrotik_host',mt.host);
    setVal('mikrotik_port',mt.port);
    setVal('mikrotik_username',mt.username);
    setVal('mikrotik_password',mt.password);
    var a=c.admin||{};
    setVal('admin_username',a.username);
    setVal('admin_password',a.password);
    var cs=c.coin_settings||{};
    setVal('coin_window_seconds',cs.window_seconds);
    setVal('coin_points_rate',cs.points_rate);
    setVal('coin_debounce_ms',cs.debounce_ms);
    var p=c.pins||{};
    setVal('pins_signal',p.coinslot_signal_pin);
    setVal('pins_set',p.coinslot_set_pin);
    setVal('pins_led',p.led_pin);
    setVal('pins_buzzer',p.buzzer_pin);
    setVal('pins_signal_active_low',String(!!p.signal_active_low));
    setVal('pins_set_active_low',String(!!p.set_active_low));
    setVal('pins_a0_reset_enabled',String(!!p.A0_3V_reset_enabled));
    var ar=c.auto_restart||{};
    setVal('auto_restart_enabled',!!ar.enabled);
    setVal('auto_restart_interval',ar.interval_minutes);
  });
}

/* ============ RATES ============ */
function loadRates(){
  api('GET','/rates',null,function(s,r){
    if(s<200||s>=300)return;
    var t=(r.data&&r.data.tiers)||[];
    $('ratesBody').innerHTML='';
    for(var i=0;i<t.length;i++)addRateRow(t[i]);
  });
}
function addRateRow(t){
  t=t||{label:'',pesos:'',minutes:''};
  var tr=document.createElement('tr');
  tr.innerHTML='<td style="padding:4px"><input type="text" class="rate-label" value="'+(t.label||'').replace(/"/g,'&quot;')+'"></td>'+
    '<td style="padding:4px"><input type="number" class="rate-pesos" value="'+(t.pesos||'')+'"></td>'+
    '<td style="padding:4px"><input type="number" class="rate-minutes" value="'+(t.minutes||'')+'"></td>'+
    '<td style="padding:4px;text-align:center"><button type="button" class="danger" onclick="this.parentNode.parentNode.remove()" style="padding:4px 8px;margin:0">X</button></td>';
  $('ratesBody').appendChild(tr);
}
function collectRates(){
  var rows=$('ratesBody').querySelectorAll('tr');
  var tiers=[];
  for(var i=0;i<rows.length;i++){
    var lbl=rows[i].querySelector('.rate-label').value.trim();
    var p=parseInt(rows[i].querySelector('.rate-pesos').value)||0;
    var mn=parseInt(rows[i].querySelector('.rate-minutes').value)||0;
    if(lbl&&p>0&&mn>0)tiers.push({label:lbl,pesos:p,minutes:mn});
  }
  return {tiers:tiers};
}

/* ============ SAVE ALL ============ */
function buildConfig(){
  return {
    version:1,
    vendo_id:parseInt(getVal('vendo_id'))||1,
    vendo_name:getVal('vendo_name'),
    network:{
      mode:getVal('network_mode'),
      static_ip:getVal('network_static_ip'),
      gateway:getVal('network_gateway'),
      netmask:getVal('network_netmask'),
      dns:getVal('network_dns')
    },
    wifi:{
      ssid:getVal('wifi_ssid'),
      password:getVal('wifi_password')
    },
    mqtt:{
      host:getVal('mqtt_host'),
      port:parseInt(getVal('mqtt_port'))||1883,
      username:getVal('mqtt_username'),
      password:getVal('mqtt_password'),
      keepalive_seconds:parseInt(getVal('mqtt_keepalive_seconds'))||60
    },
    mikrotik:{
      host:getVal('mikrotik_host'),
      port:parseInt(getVal('mikrotik_port'))||80,
      username:getVal('mikrotik_username'),
      password:getVal('mikrotik_password')
    },
    time:{
      backend_url:"http://10.99.0.8:8000/api/time",
      mikrotik_ntp_host:getVal('mikrotik_host'),
      public_ntp_fallback:"pool.ntp.org"
    },
    admin:{
      username:getVal('admin_username'),
      password:getVal('admin_password')
    },
    coin_settings:{
      window_seconds:parseInt(getVal('coin_window_seconds'))||60,
      points_rate:parseFloat(getVal('coin_points_rate'))||0.2,
      debounce_ms:parseInt(getVal('coin_debounce_ms'))||30
    },
    auto_restart:{
      enabled:getVal('auto_restart_enabled'),
      interval_minutes:parseInt(getVal('auto_restart_interval'))||1440,
      notify_backend:true
    },
    pins:{
      coinslot_signal_pin:getVal('pins_signal'),
      coinslot_set_pin:getVal('pins_set'),
      led_pin:getVal('pins_led'),
      buzzer_pin:getVal('pins_buzzer'),
      signal_active_low:getVal('pins_signal_active_low')==='true',
      set_active_low:getVal('pins_set_active_low')==='true',
      A0_3V_reset_enabled:getVal('pins_a0_reset_enabled')==='true'
    },
    config_updated_at:new Date().toISOString()
  };
}

function saveAll(){
  if(!confirm('Save all changes and reboot? The ESP will be offline for ~15 seconds.'))return;
  var cfg=buildConfig();
  var rates=collectRates();
  msg('Saving config...','info');

  api('POST','/admin/config',cfg,function(s1,r1){
    if(s1<200||s1>=300){msg('Config save failed: '+(r1.error?r1.error.message:'unknown'),'err');return}
    api('POST','/admin/rates',rates,function(s2,r2){
      if(s2<200||s2>=300){msg('Rates save failed: '+(r2.error?r2.error.message:'unknown'),'err');return}
      msg('✓ Saved! Rebooting...','ok');
      setTimeout(function(){api('POST','/admin/restart',null,function(){});},800);
    });
  });
}

