zyronjoshh-alt/RONWIFI_ESP8266/http_server.cpp
/* ============ DIAGNOSTICS ============ */
function testOpen(){
  $('diagOut').innerHTML='<div class="msg msg-info">Opening coinslot for 3s...</div>';
  api('POST','/admin/test_open',{duration_ms:3000},function(s,r){
    $('diagOut').innerHTML='<div class="msg msg-ok">✓ Coinslot opened 3s (listen for click)</div>';
  });
}

function pingMikrotik(){
  $('diagOut').innerHTML='<div class="msg msg-info">Pinging MikroTik...</div>';
  api('POST','/admin/ping_mikrotik',null,function(s,r){
    var d=r.data||r.error||{};
    var html='';
    if(r.ok){
      html+='<div class="msg msg-ok">✓ MikroTik reachable! (HTTP '+(d.http_code||200)+')</div>';
      if(d.response)html+='<pre class="diag">'+escHtml(d.response)+'</pre>';
    }else{
      html+='<div class="msg msg-err">✗ MikroTik unreachable</div>';
      html+='<pre class="diag">';
      html+='URL: '+escHtml(d.url||'?')+'\n';
      html+='HTTP Code: '+(d.http_code||'n/a')+'\n';
      html+='Error: '+escHtml(d.error||d.message||'unknown')+'\n';
      if(d.response)html+='Response:\n'+escHtml(d.response);
      html+='</pre>';
      html+='<div class="msg msg-info" style="font-size:12px">Check: /ip service enable www on MikroTik. Verify REST API user exists with full or rest-api group. See serial monitor for details.</div>';
    }
    $('diagOut').innerHTML=html;
  });
}

function escHtml(s){return String(s).replace(/[&<>"']/g,function(c){return{'&':'&amp;','<':'&lt;','>':'&gt;','"':'&quot;',"'":'&#39;'}[c]})}

function factoryReset(){
  if(!confirm('ERASE ALL config files?\n\nESP will reboot into AP mode.\nYou will need to reconfigure from scratch.'))return;
  if(!confirm('Really? This cannot be undone.'))return;
  api('POST','/admin/factory_reset',null,function(){msg('Erased. Rebooting to AP mode...','info')});
}

function restart(){
  if(!confirm('Restart ESP now?'))return;
  api('POST','/admin/restart',null,function(){msg('Rebooting...','info')});
}

/* ============ BOOT ============ */
loadStatus();loadConfig();loadRates();
setInterval(loadStatus,3000);
</script></body></html>
)HTML";

static void handleAdmin() {
  if (!requireAdminAuth()) return;
  server.send_P(200, "text/html", ADMIN_HTML);
}

static void handleAdminStatus() {
  if (!requireAdminAuth()) return;
  String body = String("{") +
    "\"vendo_id\":" + g_config.vendo_id + "," +
    "\"vendo_name\":\"" + g_config.vendo_name + "\"," +
    "\"firmware\":\"" FIRMWARE_VERSION "\"," +
    "\"uptime_s\":" + (millis() / 1000) + "," +
    "\"free_heap\":" + ESP.getFreeHeap() + "," +
    "\"rssi\":" + WiFi.RSSI() + "," +
    "\"ip\":\"" + WiFi.localIP().toString() + "\"," +
    "\"state\":\"" + (coinslotGetState() == CS_ARMED ? "armed" :
                     coinslotGetState() == CS_COUNTING ? "counting" :
                     coinslotGetState() == CS_FINALIZING ? "finalizing" : "idle") + "\"," +
    "\"pulse_count\":" + coinslotGetPulseCount() +
  "}";
  sendJsonOk(body);
}

static void handleAdminConfig() {
  if (!requireAdminAuth()) return;
  server.sendHeader("Access-Control-Allow-Origin", "*");
  String masked = configToJson();
  server.send(200, "application/json",
              String("{\"ok\":true,\"data\":") + masked + "}");
}

static void handleAdminConfigRaw() {
  if (!requireAdminAuth()) return;
  server.sendHeader("Access-Control-Allow-Origin", "*");
  String full = configToJsonFull();
  server.send(200, "application/json",
              String("{\"ok\":true,\"data\":") + full + "}");
}

static void handleAdminConfigSave() {
  if (!requireAdminAuth()) return;
  String body = server.arg("plain");
  if (body.length() < 50) {
    sendJsonError(400, "empty", "Config body empty or too small");
    return;
  }
  if (!configSave(body)) {
    sendJsonError(400, "invalid", "Config JSON invalid or missing required fields");
    return;
  }
  sendJsonOk("{\"status\":\"saved\"}");
  // Caller is expected to hit /admin/restart next; we do not auto-reboot here
  // so the success response can reach the browser first.
}

static void handleAdminRatesSave() {
  if (!requireAdminAuth()) return;
  String body = server.arg("plain");
  if (ratesSave(body)) sendJsonOk("{\"status\":\"saved\"}");
  else sendJsonError(400, "invalid", "Could not save rates");
}

static void handleAdminTestOpen() {
  if (!requireAdminAuth()) return;
  StaticJsonDocument<128> doc;
  deserializeJson(doc, server.arg("plain"));
  uint32_t dur = doc["duration_ms"] | 2000;
  coinslotTestOpen(dur);
  sendJsonOk("{\"status\":\"done\"}");
}

static void handleAdminPingMikrotik() {
  if (!requireAdminAuth()) return;
  MikrotikPingResult r = mikrotikPingDetailed();

  // Build JSON with diagnostic info (escape special chars in response/error)
  StaticJsonDocument<1024> doc;
  doc["ok"] = r.ok;
  JsonObject data = doc.createNestedObject(r.ok ? "data" : "error");
  data["http_code"] = r.http_code;
  data["url"] = r.url;
  data["error"] = r.error;
  data["response"] = r.response;
  if (!r.ok) {
    data["code"] = "mikrotik_failed";
    data["message"] = r.error;
  }

  String out;
  serializeJson(doc, out);
  server.sendHeader("Access-Control-Allow-Origin", "*");
  server.send(r.ok ? 200 : 503, "application/json", out);
}

static void handleAdminFactoryReset() {
  if (!requireAdminAuth()) return;
  LittleFS.remove("/config.json");
  LittleFS.remove("/config.backup.json");
  LittleFS.remove("/rates.json");
  LittleFS.remove("/emergency.log");
  sendJsonOk("{\"status\":\"reset\"}");
  delay(500);
  ESP.restart();
}

static void handleAdminRestart() {
  if (!requireAdminAuth()) return;
  sendJsonOk("{\"status\":\"restarting\"}");
  delay(500);
  ESP.restart();
}

static void handleNotFound() {
  sendJsonError(404, "not_found", "Endpoint not found");
}

// ---------- Init ----------
void httpServerInit() {
  server.on("/ping", HTTP_GET, handlePing);
  server.on("/ping", HTTP_OPTIONS, handleOptions);

  server.on("/coin/start", HTTP_POST, handleCoinStart);
  server.on("/coin/start", HTTP_OPTIONS, handleOptions);

  server.on("/coin/done", HTTP_POST, handleCoinDone);
  server.on("/coin/done", HTTP_OPTIONS, handleOptions);

  server.on("/coin/cancel", HTTP_POST, handleCoinCancel);
  server.on("/coin/cancel", HTTP_OPTIONS, handleOptions);

  server.on("/rates", HTTP_GET, handleRates);
  server.on("/rates", HTTP_OPTIONS, handleOptions);

  // /status/{session_id} - match any path under /status/
  server.onNotFound([]() {
    String uri = server.uri();
    if (uri.startsWith("/status/")) {
      handleStatus();
      return;
    }
    handleNotFound();
  });

  // Admin
  server.on("/admin", HTTP_GET, handleAdmin);
  server.on("/admin/status", HTTP_GET, handleAdminStatus);
  server.on("/admin/config", HTTP_GET, handleAdminConfig);
  server.on("/admin/config", HTTP_POST, handleAdminConfigSave);
  server.on("/admin/config_raw", HTTP_GET, handleAdminConfigRaw);
  server.on("/admin/rates", HTTP_POST, handleAdminRatesSave);
  server.on("/admin/test_open", HTTP_POST, handleAdminTestOpen);
  server.on("/admin/ping_mikrotik", HTTP_POST, handleAdminPingMikrotik);
  server.on("/admin/factory_reset", HTTP_POST, handleAdminFactoryReset);
  server.on("/admin/restart", HTTP_POST, handleAdminRestart);

  server.begin();
  Serial.println(F("[http] server started on :80"));
}

void httpServerLoop() {
  server.handleClient();
}

bool shouldArmCoinslot() { return false; }
void clearArmRequest() {}
